sauloverissimo/midi2cpp/examples/esp32-p4-devkit-usb-midi2/idf/sdkconfig.defaults
# ESP-IDF target + console
# UART stdio on the CH343 USB-to-UART bridge ("ToUART" USB-C jack on
# the Waveshare ESP32-P4-WIFI6-DEV-KIT). The "USB-Device" USB-C jack
# is the native USB-OTG that carries MIDI 2.0; do NOT enable USB-CDC
# stdio, it would steal endpoints from TinyUSB.
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# Secondary console on USB-Serial-JTAG (P4 has separate USB-Serial-JTAG
# and USB-OTG controllers, so this can coexist with TinyUSB MIDI 2.0
# on the USB-Device jack). Enables panic backtraces visible during
# early boot debugging when the CH343-routed UART has not been wired
# to the right pins on a custom board.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# P4 default core clock 360 MHz (HP CPU), kept default so the build
# does not depend on an option that may rename across IDF versions.

# Compiler: C++17 to match the parent library and Pico SDK recipes.
# midi2_cpp uses std::function callbacks; exceptions stay off.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Note: TinyUSB MIDI 2.0 toggles live in main/tusb_config.h
# (CFG_TUD_MIDI2 etc), not in Kconfig, because the shim component at
# components/tinyusb registers TinyUSB sources directly without going
# through the Espressif esp_tinyusb Kconfig.
